cf_billing/Documents/энргПоступлениеОплатыЧерезКонтроллера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргПоступлениеОплатыЧерезКонтроллера</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргОбъемСубсидий</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчетыПоПени</xr:Item>
				<xr:Item>AccumulationRegister.энргОбъемНачислений</xr:Item>
				<xr:Item>InformationRegister.энргПоказанияПриборовУчета</xr:Item>
				<xr:Item>AccumulationRegister.энргОплатаУслуг</xr:Item>
				<xr:Item>InformationRegister.энргИсторияОплаты</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контроллер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСменыККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЧековККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗадолженности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргВидыЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>18</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МКД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнихПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныйОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переворот</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьАбонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЛицевойСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>18</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьУслуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтклонения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргПричиныОтклоненияПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьАдресАбонента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючПомещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Documents/энргПоступлениеОплатыЧерезКонтроллера/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция МассивПриборов() Экспорт 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.Текст  	= 
	"ВЫБРАТЬ
	|	энргПоступлениеОплатыЧерезКонтроллера.ПериодНачисления КАК ПериодНачисления,
	|	энргПоступлениеОплатыЧерезКонтроллера.Дата КАК ПериодРегистрации,
	|	энргАбоненты.Район КАК Район,
	|	энргАбоненты.МКД КАК МКД,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ВложенныйЗапрос.ВыводПрибораУчета,
	|	ВложенныйЗапрос.ИмяТабЧасти
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаТочекУчета.Ссылка КАК ссылка,
	|		ТаблицаТочекУчета.Абонент КАК Абонент,
	|		ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|		ТаблицаПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ТаблицаПоказаний.ТекущиеПоказания КАК ТекущиеПоказания,
	|		ЛОЖЬ КАК ВыводПрибораУчета,
	|		""ПоказанияПриборовУчета"" КАК ИмяТабЧасти
	|	ИЗ
	|		Документ.энргПоступлениеОплатыЧерезКонтроллера.ПоказанияПриборовУчета КАК ТаблицаПоказаний
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПоступлениеОплатыЧерезКонтроллера.ТочкиУчета КАК ТаблицаТочекУчета
	|			ПО ТаблицаПоказаний.IDСтроки = ТаблицаТочекУчета.IDСтроки
	|				И ТаблицаПоказаний.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И (ТаблицаПоказаний.Ссылка = &ссылка)
	|				И (ТаблицаТочекУчета.Ссылка = &ссылка)
	|				И (НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ВложенныйЗапрос.Абонент = энргАбоненты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПоступлениеОплатыЧерезКонтроллера КАК энргПоступлениеОплатыЧерезКонтроллера
	|		ПО ВложенныйЗапрос.ссылка = энргПоступлениеОплатыЧерезКонтроллера.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Район,
	|	МКД,
	|	Абонент,
	|	ПриборУчета,
	|	ТарифнаяЗона,
	|	ПериодРегистрации,
	|	ТекущиеПоказания";
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	ДополнительныеСвойства.Вставить("Кассир",				Ответственный);
	ДополнительныеСвойства.Вставить("ИсточникПоступления",	Справочники.энргИсточникиПоступления.Касса); 
	ДополнительныеСвойства.Вставить("ГруппаАбонентов",		Истина);
	ДополнительныеСвойства.вставить("ДанныеОплаты",			ДанныеОплаты()); 	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеОплаты 					= ДанныеОплаты();
	ВыборкаОплата  					= ДанныеОплаты.выбрать();
	
	Пока ВыборкаОплата.следующий() цикл
		Запись 						= Движения.энргВзаиморасчеты.ДобавитьРасход();	
		ЗаполнитьЗначенияСвойств(Запись,ВыборкаОплата);
		Запись.Период 				= ВыборкаОплата.Дата;
		Запись.ПериодНачисления 	= ПериодНачисления;
		
		Запись 						= Движения.энргОплатаУслуг.Добавить();	
		ЗаполнитьЗначенияСвойств(Запись,ВыборкаОплата);
		Запись.Период 				= ВыборкаОплата.Дата;
		Запись.ПериодНачисления 	= ПериодНачисления;
		Запись.Кассир 				= Ответственный;
		Запись.ИсточникПоступления 	= Справочники.энргИсточникиПоступления.Касса;
	КонецЦикла; 
	
	ДанныеПоказанийПриборовУчета 	= ДанныеПоказанийПриборовУчета();
			
	энргРаботаСприборамиУчетаСервер.ЗаписатьПоказанияРезультатЗапроса(ДанныеПоказанийПриборовУчета,Движения);
	
	Результат = ПолучитьОбъемыПУ(); 	
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(Результат, Движения.энргЗарегистрированныйОбъемПриборов);
	
	Выборка 				= Результат.Выбрать();
	НаборРасчетСреднего 	= РегистрыСведений.энргРасчетСреднегоОбъема.СоздатьНаборЗаписей();
	НаборРасчетСреднего.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",истина);
	Пока Выборка.Следующий() Цикл 
		
		СтрокаНабор  			= НаборРасчетСреднего.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаНабор,Выборка);	
		СтрокаНабор.ОбъемУслуги = Выборка.ОбъемУслугиПотребленный;
		
	КонецЦикла;
	НаборРасчетСреднего.Записать(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//// Функция - Данные оплаты
//// Возвращаемое значение:
////   - 
Функция ДанныеОплаты();
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеТабЧасти",		Оплата);
	Запрос.УстановитьПараметр("Дата",				Дата);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Запрос.Текст 	= "ВЫБРАТЬ
	|	&Дата КАК Дата,
	|	&Район КАК Район,
	|	&Ссылка КАК Регистратор,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргПоступлениеОплатыЧерезКонтроллераОплата.Абонент,
	|	энргПоступлениеОплатыЧерезКонтроллераОплата.СуммаОплаты КАК Сумма
	|ПОМЕСТИТЬ Шапка
	|ИЗ
	|	&ДанныеТабЧасти КАК энргПоступлениеОплатыЧерезКонтроллераОплата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Шапка.ПериодНачисления,
	|	Шапка.Район,
	|	энргАбоненты.МКД КАК МКД,
	|	Шапка.Абонент КАК Абонент,
	|	Шапка.Сумма КАК СуммаОплаты,
	|	ИСТИНА КАК ЭтоОплата,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодВзаиморасчетов,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодВзаиморасчетовОкончание,
	|	ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка) КАК Услуга,
	|	Шапка.Дата,
	|	Шапка.Регистратор
	|ИЗ
	|	Шапка КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО Шапка.Абонент = энргАбоненты.Ссылка";
	
	Результат  = Запрос.Выполнить();
	Возврат Результат;
	 
КонецФункции

Функция ДанныеПоказанийПриборовУчета()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Текст 		= 
	"ВЫБРАТЬ
	|	энргПоступлениеОплатыЧерезКонтроллера.Дата КАК Период,
	|	энргПоступлениеОплатыЧерезКонтроллера.Дата КАК ПериодРегистрации,
	|	энргПоступлениеОплатыЧерезКонтроллера.ПериодНачисления КАК ПериодНачисления,
	|	энргАбоненты.Район КАК Район,
	|	ВложенныйЗапрос.Абонент,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.ТарифнаяЗона,
	|	ВложенныйЗапрос.Показание,
	|	ВложенныйЗапрос.СостояниеПоказаний,
	|	ВложенныйЗапрос.КС,
	|	ВложенныйЗапрос.Переворот,
	|	ВложенныйЗапрос.НомерСтрокиТЧ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаТочекУчета.Ссылка КАК ссылка,
	|		ТаблицаТочекУчета.Абонент КАК Абонент,
	|		ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|		ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
	|		ТаблицаПоказанийПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|		ЛОЖЬ КАК КС,
	|		ЛОЖЬ КАК Переворот,
	|		ТаблицаПоказанийПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ
	|	ИЗ
	|		Документ.энргПоступлениеОплатыЧерезКонтроллера.ТочкиУчета КАК ТаблицаТочекУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПоступлениеОплатыЧерезКонтроллера.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	|			ПО ТаблицаТочекУчета.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	|				И ТаблицаТочекУчета.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
	|				И (ТаблицаТочекУчета.Ссылка = &ссылка)
	|				И (ТаблицаПоказанийПриборовУчета.Ссылка = &Ссылка)
	|				И (НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ВложенныйЗапрос.Абонент = энргАбоненты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПоступлениеОплатыЧерезКонтроллера КАК энргПоступлениеОплатыЧерезКонтроллера
	|		ПО ВложенныйЗапрос.ссылка = энргПоступлениеОплатыЧерезКонтроллера.Ссылка";
		
	Запрос.Текст = Текст;
	
	Возврат Запрос.Выполнить();  	
КонецФункции 

Функция ПолучитьОбъемыПУ()
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	|	&ДокументСсылка КАК ДокРегистратор,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТаблицаПоказанийПриборовУчета.Разница КАК ОбъемУслугиПотребленный,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	ВложенныйЗапрос.Период КАК Период,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПриборовУчета.Ссылка КАК Ссылка,
	|		ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
	|		ТаблицаШкал.Шкала КАК Шкала,
	|		ТаблицаШкал.IDСтроки КАК IDСтроки,
	|		ТаблицаДокумента.Организация КАК Организация,
	|		ТаблицаДокумента.Район КАК Район,
	|		ТаблицаПриборовУчета.КлючПомещения КАК КлючПомещения,
	|		ТаблицаДокумента.ПериодНачисления КАК ПериодНачисления,
	|		ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	|		ТаблицаПриборовУчета.ПриборУчета.РегистрируетОбъем КАК РегистрируетОбъем,
	|		&Период КАК Период
	|	ИЗ
	|		Документ.энргПоступлениеОплатыЧерезКонтроллера.ТочкиУчета КАК ТаблицаПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПоступлениеОплатыЧерезКонтроллера.ШкалыПриборовУчета КАК ТаблицаШкал
	|			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаШкал.Ссылка
	|				И ТаблицаПриборовУчета.IDСтроки = ТаблицаШкал.IDСтрокиТочкиУчета
	|				И (ТаблицаПриборовУчета.Ссылка = &ДокументСсылка)
	|				И (ТаблицаШкал.Ссылка = &ДокументСсылка)
	|				И (НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПоступлениеОплатыЧерезКонтроллера КАК ТаблицаДокумента
	|			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаДокумента.Ссылка
	|				И (ТаблицаПриборовУчета.Ссылка = &ДокументСсылка)
	|				И (ТаблицаДокумента.Ссылка = &ДокументСсылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПоступлениеОплатыЧерезКонтроллера.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	|		ПО ВложенныйЗапрос.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
	|			И (ТаблицаПоказанийПриборовУчета.Ссылка = &ДокументСсылка)
	|			И (ВложенныйЗапрос.РегистрируетОбъем)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.Ссылка";
	
	Запрос.УстановитьПараметр("ДокументСсылка"	,Ссылка);
	Запрос.УстановитьПараметр("Период"			,Дата);
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
